trade_exp/src/Documents/ПриходныйОрдерНаТовары/ПриходныйОрдерНаТовары.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Document xmlns:mdclassExtension="http://g5.1c.ru/v8/dt/metadata/mdclass/extension" extendedConfigurationObject="6a90e124-5af0-4a37-8ff7-14481b8cb2dd">
  <name>ПриходныйОрдерНаТовары</name>
  <objectBelonging>Adopted</objectBelonging>
  <registerRecords>AccumulationRegister.ДвижениеМаркированногоТовара</registerRecords>
  <attributes extendedConfigurationObject="c9e23b65-d2dd-4d5e-91a1-60a62757322c">
    <name>РабочийУчасток</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes extendedConfigurationObject="5a3dfe1b-75d0-4247-8d64-84bab203cf9c">
    <name>Отправитель</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes extendedConfigurationObject="bbce78e7-d91d-4dac-8a0c-b47e64d9325b">
    <name>Ответственный</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes extendedConfigurationObject="9cd3d95f-95cb-4f59-909e-802e5579ac5b">
    <name>ДатаВходящегоДокумента</name>
    <objectBelonging>Adopted</objectBelonging>
    <extension>
      <typeExtension>
        <dateQualifiers>
          <dateFractions>Date</dateFractions>
        </dateQualifiers>
      </typeExtension>
    </extension>
  </attributes>
  <attributes extendedConfigurationObject="8762c46f-68da-4109-a1f4-fb201e69cf69">
    <name>Комментарий</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes extendedConfigurationObject="f481b21a-9531-4e52-9957-c494f5e377f6">
    <name>Статус</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes extendedConfigurationObject="0c0f355e-967b-4aef-9cf3-b95cc9fdfcef">
    <name>НомерВходящегоДокумента</name>
    <objectBelonging>Adopted</objectBelonging>
    <extension>
      <typeExtension>
        <stringQualifiers>
          <length>50</length>
        </stringQualifiers>
      </typeExtension>
    </extension>
  </attributes>
  <attributes extendedConfigurationObject="d0368be3-8269-42f8-b1e8-5a902ab8fbd0">
    <name>Склад</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes extendedConfigurationObject="95326fc6-5780-440a-84af-cd29440e2b58">
    <name>Помещение</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes extendedConfigurationObject="ca8589c8-0a63-4506-aa59-5684f62c08c1">
    <name>ЗонаПриемки</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes extendedConfigurationObject="8a679cf3-b805-4f49-bee6-d93a2702e946">
    <name>СкладскаяОперация</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes extendedConfigurationObject="b49b6320-3833-4d7e-9256-844ccbfa090e">
    <name>ХозяйственнаяОперация</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes extendedConfigurationObject="06e8c720-eb9f-425a-9716-baef1a36e9a3">
    <name>Исполнитель</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes extendedConfigurationObject="0cdca97b-7d3f-41b0-a49d-95b6449dd7ac">
    <name>РежимПросмотраПоТоварам</name>
    <objectBelonging>Adopted</objectBelonging>
    <extension>
      <typeExtension>
        <numberQualifiers>
          <precision>1</precision>
        </numberQualifiers>
      </typeExtension>
    </extension>
  </attributes>
  <attributes extendedConfigurationObject="efa8b93c-791b-4449-99fd-217a3baf3df6">
    <name>ВсегоМест</name>
    <objectBelonging>Adopted</objectBelonging>
    <extension>
      <typeExtension>
        <numberQualifiers>
          <precision>10</precision>
        </numberQualifiers>
      </typeExtension>
    </extension>
  </attributes>
  <attributes extendedConfigurationObject="4979558b-bd14-48f3-a52d-805e31ec5e65">
    <name>Сотрудник</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes extendedConfigurationObject="5dcdee8c-9444-4bd3-ae94-e55f618ed216">
    <name>Распоряжение</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes extendedConfigurationObject="8187f1a4-6517-4240-ace4-08511908ce30">
    <name>ВходящийДокумент</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <tabularSections extendedConfigurationObject="4c33a3ea-7a9b-4d40-8f7d-a7581e73da16">
    <name>Товары</name>
    <objectBelonging>Adopted</objectBelonging>
    <attributes extendedConfigurationObject="193cb4c0-81db-49ab-a130-d34f2a776519">
      <name>СтатусУказанияСерий</name>
      <objectBelonging>Adopted</objectBelonging>
      <extension>
        <typeExtension>
          <numberQualifiers>
            <precision>2</precision>
          </numberQualifiers>
        </typeExtension>
      </extension>
    </attributes>
    <attributes extendedConfigurationObject="eeb10de4-4d97-4473-b2ac-e752ff3ab390">
      <name>Комментарий</name>
      <objectBelonging>Adopted</objectBelonging>
    </attributes>
    <attributes extendedConfigurationObject="9dd9c28c-0ab6-479c-907f-118c9feac29e">
      <name>Упаковка</name>
      <objectBelonging>Adopted</objectBelonging>
    </attributes>
    <attributes extendedConfigurationObject="fa78140c-0253-4803-87da-cf38870a1ab3">
      <name>Штрихкод</name>
      <objectBelonging>Adopted</objectBelonging>
      <extension>
        <typeExtension>
          <stringQualifiers>
            <length>200</length>
          </stringQualifiers>
        </typeExtension>
      </extension>
    </attributes>
    <attributes extendedConfigurationObject="8496f61d-538d-4d21-80c3-b273a1617696">
      <name>Номенклатура</name>
      <objectBelonging>Adopted</objectBelonging>
    </attributes>
    <attributes extendedConfigurationObject="55fb4905-a811-46e2-9192-771e2fb958cc">
      <name>УпаковочныйЛист</name>
      <objectBelonging>Adopted</objectBelonging>
    </attributes>
    <attributes extendedConfigurationObject="75fac7f0-d3fd-4458-a727-7598962ea772">
      <name>Характеристика</name>
      <objectBelonging>Adopted</objectBelonging>
    </attributes>
    <attributes extendedConfigurationObject="75e84f0f-f847-4153-b485-7a92a831f94b">
      <name>Назначение</name>
      <objectBelonging>Adopted</objectBelonging>
    </attributes>
    <attributes extendedConfigurationObject="1f572790-edb3-4f4d-b716-aac43eeb7c85">
      <name>Серия</name>
      <objectBelonging>Adopted</objectBelonging>
    </attributes>
    <attributes extendedConfigurationObject="f4b9edd5-b41d-4b6b-86c5-b4d3896e8b32">
      <name>КоличествоУпаковок</name>
      <objectBelonging>Adopted</objectBelonging>
      <extension>
        <typeExtension>
          <numberQualifiers>
            <precision>15</precision>
            <scale>3</scale>
          </numberQualifiers>
        </typeExtension>
      </extension>
    </attributes>
  </tabularSections>
  <tabularSections extendedConfigurationObject="4058b5f7-fa3b-4b4e-abe9-cf3afe19677f">
    <name>ШтрихкодыУпаковок</name>
    <objectBelonging>Adopted</objectBelonging>
    <attributes extendedConfigurationObject="f4ff2bf1-a8d5-487c-98fc-c15da9a88779">
      <name>ШтрихкодУпаковки</name>
      <objectBelonging>Adopted</objectBelonging>
    </attributes>
  </tabularSections>
</mdclass:Document>

trade_exp/src/InformationRegisters/ШтрихкодыНоменклатуры/ШтрихкодыНоменклатуры.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister xmlns:mdclassExtension="http://g5.1c.ru/v8/dt/metadata/mdclass/extension">
  <name>ШтрихкодыНоменклатуры</name>
  <objectBelonging>Adopted</objectBelonging>
  <extension>
    <informationRegisterPeriodicity>Checked</informationRegisterPeriodicity>
    <writeMode>Checked</writeMode>
  </extension>
  <resources>
    <name>Характеристика</name>
    <objectBelonging>Adopted</objectBelonging>
  </resources>
  <resources>
    <name>Упаковка</name>
    <objectBelonging>Adopted</objectBelonging>
  </resources>
  <resources>
    <name>Номенклатура</name>
    <objectBelonging>Adopted</objectBelonging>
  </resources>
  <resources>
    <name>Наш</name>
    <objectBelonging>Adopted</objectBelonging>
  </resources>
  <attributes extendedConfigurationObject="a9733f12-e26b-44d6-8c73-49b629ab1280">
    <name>Ответственный</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <dimensions>
    <name>Штрихкод</name>
    <objectBelonging>Adopted</objectBelonging>
    <extension>
      <typeExtension>
        <stringQualifiers>
          <length>200</length>
        </stringQualifiers>
      </typeExtension>
    </extension>
  </dimensions>
</mdclass:InformationRegister>

trade_exp/src/Documents/ПриходныйОрдерНаТовары/Forms/Док_НеопознаннаяНоменклатура/Module.bsl
#Область ОбработчикиСобытийФормы

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)

	Если Параметры.Свойство("Номенклатура") Тогда
		Номенклатура = Параметры.Номенклатура;
	КонецЕсли;  
	
	Если Параметры.Свойство("ЗаказПоставщику") Тогда
		ЗаказПоставщику = Параметры.ЗаказПоставщику;
	КонецЕсли; 
	
	Если Параметры.Свойство("ПриходныйОрдерНаТовары") Тогда
		ПриходныйОрдерНаТовары = Параметры.ПриходныйОрдерНаТовары;
	КонецЕсли; 
		 
КонецПроцедуры 

&НаКлиенте
Процедура ПриОткрытии(Отказ)
	
	#Если МобильноеПриложениеКлиент ИЛИ МобильныйКлиент Тогда
		Элементы.ГруппаФотоТовара.Группировка = ГруппировкаПодчиненныхЭлементовФормы.Вертикальная;
		Элементы.ГруппаКоманды.Группировка = ГруппировкаПодчиненныхЭлементовФормы.Вертикальная;  
		
		Элементы.Декорация1.Шрифт  = Новый Шрифт(Элементы.Декорация1.Шрифт, , , , , , , 115);
		Элементы.Выбрать.Шрифт = Новый Шрифт(Элементы.Выбрать.Шрифт, , , , , , , 115);
		Элементы.НовыйШтрихкод.ШрифтЗаголовка = Новый Шрифт(Элементы.НовыйШтрихкод.ШрифтЗаголовка, , , , , , , 115);
		Элементы.НовыйШтрихкод.Шрифт = Новый Шрифт(Элементы.НовыйШтрихкод.Шрифт, , , , , , , 115);  
		Элементы.ДобавитьШКиЗакрыть.Шрифт = Новый Шрифт(Элементы.ДобавитьШКиЗакрыть.Шрифт, , , , , , , 110);
		Элементы.ПродолжитьБезДобавленияШтрихкода.Шрифт = Новый Шрифт(Элементы.ПродолжитьБезДобавленияШтрихкода.Шрифт, , , , , , , 110);
	#КонецЕсли

КонецПроцедуры

#КонецОбласти 

#Область ОбработчикиКомандФормы

&НаКлиенте
Процедура Выбрать(Команда)
	
	#Если МобильноеПриложениеКлиент ИЛИ МобильныйКлиент Тогда
	    Если ЭтаФорма.ВводДоступен() Тогда
			Кнопки = КнопкиОповещения();
			ПоказатьВопрос(Новый ОписаниеОповещения("ВыбратьСпособДобавленияФото", Этаформа), "Загрузите фото.", Кнопки);	
		КонецЕсли;
	#Иначе
		ДобавитьФото();
	#КонецЕсли
			
КонецПроцедуры  

&НаКлиенте
Процедура ДобавитьШКиЗакрыть(Команда)

	ДобавитьШКСервер(НовыйШтрихкод, Номенклатура);
	ЗакрытьФорму();
	
КонецПроцедуры  

&НаКлиенте
Процедура ПродолжитьБезДобавленияШтрихкода(Команда)
	
	ЗакрытьФорму();
	
КонецПроцедуры    

#КонецОбласти 

#Область СлужебныеПроцедурыИФункции

&НаСервереБезКонтекста
Функция КнопкиОповещения()
	
	Кнопки = Новый СписокЗначений;
	Кнопки.Добавить("Отмена");
	Кнопки.Добавить("С телефона");
	Кнопки.Добавить("Камера");
	
	Возврат Кнопки;
	
КонецФункции 

&НаКлиенте
Процедура ВыбратьСпособДобавленияФото(РезультатВопроса, ДополнительныеПараметры) Экспорт
	
	Если РезультатВопроса = "Камера" Тогда
		СделатьФотоКамерой();
	ИначеЕсли 
		РезультатВопроса = "С телефона" Тогда
		ДобавитьФото();
	Иначе
		Возврат;
	КонецЕсли;  
	
КонецПроцедуры

&НаКлиенте
Процедура ДобавитьФото()
	
	Диалог = Новый ДиалогВыбораФайла(РежимДиалогаВыбораФайла.Открытие);
	Диалог.Заголовок = "Выберите файл";
	Диалог.Фильтр = "Все картинки (*.jpg;*.jpeg;*.tif;*.png)"
		+ "|*.jpg;*.jpeg;*.tif;*.png|";
	Диалог.МножественныйВыбор = Истина;
	Диалог.ПроверятьСуществованиеФайла = Истина;
	
	Если Диалог.Выбрать() Тогда 
		МассивФайлов = Диалог.ВыбранныеФайлы;
		Сч = 0;
		Для каждого Файл Из МассивФайлов Цикл 
			ВыбранныйФайл = Новый Файл(Файл); 
            ДвоичныеДанные = Новый ДвоичныеДанные(ВыбранныйФайл.ПолноеИмя); 
			#Если МобильноеПриложениеКлиент ИЛИ МобильныйКлиент Тогда
			    ПредставлениеФайла = ВыбранныйФайл.ПолучитьПредставлениеФайлаБиблиотекиМобильногоУстройства();
				РасширениеФайла = СтрРазделить(ПредставлениеФайла, ".");
				Расширение = РасширениеФайла[РасширениеФайла.Количество() - 1];
			#Иначе
				Расширение = ВыбранныйФайл.Расширение;
			#КонецЕсли
			Попытка
				ДобавитьНовыйПрисоединенныйФайл(ДвоичныеДанные, Расширение);
				Сч = Сч + 1;
			Исключение
			КонецПопытки;
		КонецЦикла;
		ПоказатьПредупреждение( , "Загружено " + Сч + " из " + МассивФайлов.Количество() + " файлов", 1);
		
		Элементы.ГруппаФотоТовара.Видимость = Ложь;
		Элементы.ГруппаШК.Видимость = Истина;
	КонецЕсли;

КонецПроцедуры   

&НаКлиенте
Процедура СделатьФотоКамерой()
	
	#Если МобильноеПриложениеКлиент ИЛИ МобильныйКлиент Тогда	
		ДанныеМультимедиа = Неопределено;
		
		Если СредстваМультимедиа.ПоддерживаетсяФотоснимок() Тогда	
			ДанныеМультимедиа = СредстваМультимедиа.СделатьФотоснимок(, Новый РазрешениеКамерыУстройства(1920, 2400) , 100, , ТипПодсветкиКамеры.Включена);	
		Иначе    
			Сообщить(НСтр("ru = 'Съемка фото не поддерживается.'", "ru"));
		КонецЕсли; 
		
		Если ДанныеМультимедиа <> Неопределено Тогда
			Попытка
				ДобавитьНовыйПрисоединенныйФайл(ДанныеМультимедиа.ПолучитьДвоичныеДанные(), ДанныеМультимедиа.РасширениеФайла);
				ПоказатьВопрос(Новый ОписаниеОповещения("ЗагрузитьЗавершение", Этаформа), "Изображение успешно загружено." + Символы.ПС + "Добавить новый снимок?", РежимДиалогаВопрос.ДаНет, 0.1);
			Исключение
				Ошибка = ИнформацияОбОшибке();
				ПодробнаяОшибка = ПодробноеПредставлениеОшибки(Ошибка);
				Сообщить(ПодробнаяОшибка);
			КонецПопытки;
		КонецЕсли;
	#КонецЕсли

КонецПроцедуры 

&НаКлиенте
Процедура ЗагрузитьЗавершение(РезультатВопроса, ДополнительныеПараметры) Экспорт
	
	Если РезультатВопроса = КодВозвратаДиалога.Да Тогда
		СделатьФотоКамерой();
	Иначе 
		Элементы.ГруппаФотоТовара.Видимость = Ложь;
		Элементы.ГруппаШК.Видимость = Истина;
	КонецЕсли; 
	
КонецПроцедуры

&НаСервере
Процедура ДобавитьНовыйПрисоединенныйФайл(ДвоичныеДанные, Расширение)
	
	УстановитьПривилегированныйРежим(Истина); 
	
	СчетчикФото = СчетчикФото + 1;
	ПриходныйОрдер = ?(ЗначениеЗаполнено(ПриходныйОрдерНаТовары), "_" + СтрЗаменить(Строка(ПриходныйОрдерНаТовары), ":", "."), "");
	Имя = "Неоп.товар" + ПриходныйОрдер + " (" + СчетчикФото + ")";
 	
	АдресВХранилище = ПоместитьВоВременноеХранилище(ДвоичныеДанные);
	ПараметрыФайла = РаботаСФайлами.ПараметрыДобавленияФайла();
	ПараметрыФайла.Автор = ПараметрыСеанса.ТекущийПользователь.Наименование;
	ПараметрыФайла.ВладелецФайлов = ЗаказПоставщику; 
	ПараметрыФайла.ИмяБезРасширения = Имя;
	ПараметрыФайла.РасширениеБезТочки = Расширение;
	РаботаСФайлами.ДобавитьФайл(ПараметрыФайла, АдресВХранилище);	
	
	УстановитьПривилегированныйРежим(Ложь);
	
КонецПроцедуры

&НаСервереБезКонтекста
Процедура ДобавитьШКСервер(НовыйШтрихкод, Номенклатура)
	
	МенеджерЗаписи = РегистрыСведений.ШтрихкодыНоменклатуры.СоздатьМенеджерЗаписи();	
	МенеджерЗаписи.Штрихкод = НовыйШтрихкод;
	МенеджерЗаписи.Номенклатура = Номенклатура;
	МенеджерЗаписи.Записать(Ложь);
	
КонецПроцедуры

&НаКлиенте
Процедура ЗакрытьФорму()
	
	Закрыть(Номенклатура);
	
КонецПроцедуры

#КонецОбласти
